app/Http/Controllers/AdminController.php

      });

      // Usuarios por mes (últimos 6 meses)
      $usersPerMonth = User::where('company_id', $companyId)
         ->select(DB::raw('TO_CHAR(created_at, \'Month YYYY\') as month'), DB::raw('count(*) as count'), DB::raw('MIN(created_at) as date_order'))
         ->whereDate('created_at', '>=', now()->subMonths(6))
         ->groupBy(DB::raw('TO_CHAR(created_at, \'Month YYYY\')'))
         ->orderBy('date_order')
         ->get();
---
select TO_CHAR(created_at, 'Month YYYY') as month, count(*) as count, MIN(created_at) as date_order from "users" where "company_id" = 1 and "created_at"::date >= '2025-01-31' group by TO_CHAR(created_at, 'Month YYYY') order by "date_order" asc

         ->get();

      // Proveedores agregados por mes (últimos 6 meses)
      $suppliersPerMonth = DB::table('suppliers')
         ->select(
            DB::raw('TO_CHAR(created_at, \'Month YYYY\') as month'),
            DB::raw('count(*) as count'),
            DB::raw('MIN(created_at) as date_order')
         )
         ->where('company_id', $companyId)
         ->whereDate('created_at', '>=', now()->subMonths(6))
         ->groupBy(DB::raw('TO_CHAR(created_at, \'Month YYYY\')'))
         ->orderBy('date_order')
         ->get();
---
select TO_CHAR(created_at, 'Month YYYY') as month, count(*) as count, MIN(created_at) as date_order from "suppliers" where "company_id" = 1 and "created_at"::date >= '2025-01-31' group by TO_CHAR(created_at, 'Month YYYY') order by "date_order" asc

         : 0;

      // Top 10 productos más vendidos
      $topSellingProducts = DB::table('sale_details as sd')
         ->select(
            'p.name',
            DB::raw('COUNT(sd.id) as times_sold'),
            DB::raw('SUM(sd.quantity) as total_quantity'),
            'p.sale_price',
            DB::raw('SUM(sd.quantity * p.sale_price) as total_revenue')
         )
         ->join('products as p', 'sd.product_id', '=', 'p.id')
         ->join('sales as s', 'sd.sale_id', '=', 's.id')
         ->where('s.company_id', $companyId)
         ->groupBy('p.id', 'p.name', 'p.sale_price')
         ->orderByDesc('total_quantity')
         ->limit(10)
         ->get();
---
select COALESCE(cat.name, 'Sin Categoría') as name, COUNT(sd.id) as total_sales, SUM(sd.quantity) as total_quantity, SUM(sd.quantity * p.sale_price) as total_revenue from "sale_details" as "sd" inner join "products" as "p" on "sd"."product_id" = "p"."id" left join "categories" as "cat" on "p"."category_id" = "cat"."id" inner join "sales" as "s" on "sd"."sale_id" = "s"."id" where "s"."company_id" = 1 group by "cat"."id", "cat"."name" order by "total_revenue" desc