app/Http/Controllers/AdminController.php

   public function __construct()
   {
      $this->middleware(function ($request, $next) {
         $this->company = Auth::user()->company;
         $this->currencies = DB::table('currencies')
            ->where('country_id', $this->company->country)
            ->first();

         return $next($request);
      });
---
select * from "companies" where "companies"."id" = 1 limit 1
select * from "currencies" where "country_id" = '162' limit 1

   public function index()
   {
      $companyId = Auth::user()->company_id;
      $currency = $this->currencies;
      // Obtener conteos básicos
      $usersCount = User::where('company_id', $companyId)->count();
      $rolesCount = Role::count();
      $categoriesCount = Category::where('company_id', $companyId)->count();
      $productsCount = Product::where('company_id', $companyId)->count();

      // Usuarios por rol
      $usersByRole = Role::withCount(['users' => function ($query) use ($companyId) {
         $query->where('company_id', $companyId);
      }])->get()->map(function ($role) {
         return [
            'name' => ucfirst($role->name),
            'count' => $role->users_count
         ];
      });

      // Usuarios por mes (últimos 6 meses)
      $usersPerMonth = User::where('company_id', $companyId)
         ->select(DB::raw('DATE_FORMAT(created_at, "%M %Y") as month'), DB::raw('count(*) as count'))
         ->whereDate('created_at', '>=', now()->subMonths(6))
         ->groupBy('month')
         ->orderBy('created_at')
         ->get();

      // Productos por categoría
      $productsByCategory = Category::where('company_id', $companyId)
         ->withCount('products')
         ->get()
         ->map(function ($category) {
            return [
               'name' => $category->name,
               'count' => $category->products_count
            ];
         });
      // Obtener conteo de proveedores
      $suppliersCount = DB::table('suppliers')
         ->where('company_id', $companyId)
         ->count();

      // Proveedores más activos (con más productos asociados)
      $topSuppliers = DB::table('suppliers')
         ->select('suppliers.company_name', DB::raw('COUNT(products.id) as products_count'))
         ->leftJoin('products', 'products.supplier_id', '=', 'suppliers.id')
         ->where('suppliers.company_id', $companyId)
         ->groupBy('suppliers.id', 'suppliers.company_name')
         ->orderByDesc('products_count')
         ->limit(5)
         ->get();

      // Valor total de inventario por proveedor
      $supplierInventoryValue = DB::table('suppliers')
         ->select(
            'suppliers.company_name',
            DB::raw('SUM(products.stock * products.purchase_price) as total_value'),
            DB::raw('COUNT(products.id) as products_count')
         )
         ->leftJoin('products', 'suppliers.id', '=', 'products.supplier_id')
         ->where('suppliers.company_id', $companyId)
         ->groupBy('suppliers.id', 'suppliers.company_name')
         ->orderByDesc('total_value')
         ->get();
---
select count(*) as aggregate from "categories" where "company_id" = 1
select count(*) as aggregate from "products" where "company_id" = 1
select count(*) as aggregate from "users" where "company_id" = 1
select count(*) as aggregate from "roles" where "company_id" = 1
select "categories".*, (select count(*) from "products" where "categories"."id" = "products"."category_id") as "products_count" from "categories" where "company_id" = 1
select count(*) as aggregate from "suppliers" where "company_id" = 1
select "suppliers"."company_name", COUNT(products.id) as products_count from "suppliers" left join "products" on "products"."supplier_id" = "suppliers"."id" where "suppliers"."company_id" = 1 group by "suppliers"."id", "suppliers"."company_name" order by "products_count" desc limit 5
select "suppliers"."company_name", SUM(products.stock * products.purchase_price) as total_value, COUNT(products.id) as products_count from "suppliers" left join "products" on "suppliers"."id" = "products"."supplier_id" where "suppliers"."company_id" = 1 group by "suppliers"."id", "suppliers"."company_name" order by "total_value" desc

         ->get();

      // Proveedores con productos bajo stock mínimo
      $suppliersWithLowStock = DB::table('suppliers')
         ->select(
            'suppliers.company_name',
            DB::raw('COUNT(DISTINCT products.id) as low_stock_products')
         )
         ->join('products', 'suppliers.id', '=', 'products.supplier_id')
         ->where('suppliers.company_id', $companyId)
         ->whereRaw('products.stock <= products.min_stock')
         ->groupBy('suppliers.id', 'suppliers.company_name')
         ->having('low_stock_products', '>', 0)
         ->orderByDesc('low_stock_products')
         ->get();
---
select "suppliers"."company_name", COUNT(DISTINCT products.id) as low_stock_products from "suppliers" inner join "products" on "suppliers"."id" = "products"."supplier_id" where "suppliers"."company_id" = 1 and products.stock <= products.min_stock group by "suppliers"."id", "suppliers"."company_name" having COUNT(DISTINCT products.id) > 0 order by "low_stock_products" desc

         ->first();

      // Proveedor principal (basado en cantidad de productos comprados)
      $topSupplier = DB::table('purchase_details')
         ->select(
            'suppliers.company_name as name',
            DB::raw('SUM(purchase_details.quantity) as total_quantity'),
            DB::raw('SUM(purchase_details.quantity * products.purchase_price) as total_amount')
         )
         ->join('suppliers', 'purchase_details.supplier_id', '=', 'suppliers.id')
         ->join('products', 'purchase_details.product_id', '=', 'products.id')
         ->join('purchases', 'purchase_details.purchase_id', '=', 'purchases.id')
         ->where('purchases.company_id', $companyId)
         ->whereMonth('purchases.purchase_date', now()->month)
         ->whereYear('purchases.purchase_date', now()->year)
         ->groupBy('suppliers.id', 'suppliers.company_name')
         ->orderByDesc('total_quantity')
         ->first() ?? (object)[
            'name' => 'N/A',
            'total_quantity' => 0,
            'total_amount' => 0
         ];
---
select "products"."name", SUM(purchase_details.quantity) as total_quantity from "purchase_details" inner join "products" on "purchase_details"."product_id" = "products"."id" inner join "purchases" on "purchase_details"."purchase_id" = "purchases"."id" where "purchases"."company_id" = 1 group by "products"."id", "products"."name" order by "total_quantity" desc limit 1

         $date = now()->subMonths($i);
         $monthlyLabels[] = $date->format('M Y');

         $monthlyActivity[] = DB::table('customers')
            ->where('company_id', $companyId)
            ->whereMonth('created_at', $date->month)
            ->whereYear('created_at', $date->year)
            ->count();
---
select count(*) as aggregate from "customers" where "company_id" = 1

      }

      // Clientes verificados (con NIT)
      $verifiedCustomers = DB::table('customers')
         ->where('company_id', $companyId)
         ->whereNotNull('nit_number')
         ->count();
---
select count(*) as aggregate from "customers" where "company_id" = 1 and extract(month from "created_at") = '07'