app/Models/Customer.php

   public function getCurrentCashCountOpeningDate()
   {
      $currentCashCount = \App\Models\CashCount::where('company_id', $this->company_id)
         ->whereNull('closing_date')
         ->first();
---
select * from "cash_counts" where "company_id" = 1 and "closing_date" is null limit 1

   public function getTotalPaymentsAfterDate($date)
   {
      // Buscar en la tabla debt_payments si existe
      if (Schema::hasTable('debt_payments')) {
         return DB::table('debt_payments')
            ->where('customer_id', $this->id)
            ->where('created_at', '>=', $date)
            ->sum('payment_amount');
---
select sum("payment_amount") as aggregate from "debt_payments" where "customer_id" = 37 and "created_at" >= '2025-07-27 12:44:23'

   public function getPreviousCashCountDebtAmount()
   {
      $currentCashCountOpeningDate = $this->getCurrentCashCountOpeningDate();

      // Obtener todas las ventas del cliente ordenadas por fecha (más antiguas primero)
      $sales = $this->sales()
         ->where('sale_date', '<', $currentCashCountOpeningDate)
         ->orderBy('sale_date', 'asc')
         ->get(['id', 'total_price', 'sale_date']);

      // Obtener todos los pagos del cliente ordenados por fecha
      $payments = [];
      if (Schema::hasTable('debt_payments')) {
         $payments = DB::table('debt_payments')
            ->where('customer_id', $this->id)
            ->where('company_id', $this->company_id)
            ->orderBy('created_at', 'asc')
            ->get(['id', 'payment_amount', 'created_at']);
      }

      $remainingDebt = 0;
      $totalPayments = $payments->sum('payment_amount');
      $totalSalesBefore = $sales->sum('total_price');
---
select sum("total_price") as aggregate from "sales" where "sales"."customer_id" = 37 and "sales"."customer_id" is not null and "sale_date" >= '2025-07-27 12:44:23'